fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Договора</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Акт</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создать акты.
// 
// Параметры:
//  Период - структура
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Создать акты
Функция СоздатьАкты(Период) Экспорт
	
	//Первоночальное заполнение ТЧ (Договорами и Актами к ним если они есть)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ДоговорыКонтрагентов.Ссылка КАК Договор,
				   |	ДоговорыКонтрагентов.ВидДоговора,
				   |	ДоговорыКонтрагентов.ВКМ_ДатаНачала КАК ДатаНачала,
				   |	ВЫБОР
				   |		КОГДА ДоговорыКонтрагентов.ВКМ_ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				   |			ТОГДА ДАТАВРЕМЯ(2999, 12, 31, 23, 59, 59)
				   |		ИНАЧЕ ДоговорыКонтрагентов.ВКМ_ДатаОкончания
				   |	КОНЕЦ КАК ДатаОкончания
				   |ПОМЕСТИТЬ ВТ_Договора
				   |ИЗ
				   |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
				   |ГДЕ
				   |	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
				   |	И (ДоговорыКонтрагентов.ВКМ_ДатаНачала <= &ДатаК
				   |	И ВЫБОР
				   |		КОГДА ДоговорыКонтрагентов.ВКМ_ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				   |			ТОГДА ДАТАВРЕМЯ(2999, 12, 31, 23, 59, 59)
				   |		ИНАЧЕ ДоговорыКонтрагентов.ВКМ_ДатаОкончания
				   |	КОНЕЦ > &ДатаН)
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	РеализацияТоваровУслуг.Ссылка КАК Акт,
				   |	РеализацияТоваровУслуг.Договор
				   |ПОМЕСТИТЬ ВТ_Акты
				   |ИЗ
				   |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				   |ГДЕ
				   |	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаН И &ДатаК
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТ_Договора.Договор,
				   |	ЕСТЬNULL(ВТ_Акты.Акт, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Акт
				   |ИЗ
				   |	ВТ_Договора КАК ВТ_Договора
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Акты КАК ВТ_Акты
				   |		ПО ВТ_Договора.Договор = ВТ_Акты.Договор";

	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("ДатаН", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаК", Период.ДатаОкончания);

	Результат = Запрос.Выполнить();
	Таблица = Результат.Выгрузить();

	
	//Обход ТЧ и формирование актов
	Счетчик = 0;
	Отказ = ложь;
	Для Каждого СтрокаТЧ Из Таблица Цикл

		ОбъектАкт = Неопределено;

		Если СтрокаТЧ.Акт <> Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
			ОбъектАкт = СтрокаТЧ.Акт.ПолучитьОбъект();
		Иначе
			ОбъектАкт = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДанныеДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.Договор, "Организация, Владелец");
			ОбъектАкт.Дата = Период.ДатаОкончания ;//ОбщегоНазначения.ТекущаяДатаПользователя();
			ОбъектАкт.Организация = ДанныеДоговора.Организация;
			ОбъектАкт.Контрагент = ДанныеДоговора.Владелец;
			ОбъектАкт.Договор = СтрокаТЧ.Договор;
			ОбъектАкт.Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
		
		
		ОбъектАкт.ВыполнитьАвтозаполнение(Отказ);
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
		
		ОбъектАкт.СуммаДокумента = ОбъектАкт.Услуги.Итог("Сумма");

		Если ОбъектАкт.ПроверитьЗаполнение() Тогда
//			РежимПроведения = ?(ОбъектАкт.Проведен, РежимПроведенияДокумента.Неоперативный,
//				РежимПроведенияДокумента.Оперативный);
			РежимПроведения = РежимПроведенияДокумента.Неоперативный;
			ОбъектАкт.Записать(РежимЗаписиДокумента.Проведение, РежимПроведения);
		Иначе
			ОбъектАкт.Записать(РежимЗаписиДокумента.Запись);
			СтрокаШаблон = СтрШаблон("Отмена проведения документа ""%1"", не заполнены ключевые данные!",
				ОбъектАкт.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(СтрокаШаблон, , "Объект.Договора[" + Счетчик + "].Акт");
		КонецЕсли;
		СтрокаТЧ.Акт = ОбъектАкт.Ссылка;
		Счетчик = Счетчик +1;

	КонецЦикла;
	
	
	Возврат Таблица;

КонецФункции


#КонецОбласти


#КонецЕсли
